

Mobile Ad hoc Networks Working Group                          C. Perkins
Internet-Draft
Intended status: Standards Track                             I. Chakeres
Expires: September 13, 2012                                       CenGen
                                                          March 12, 2012


                Dynamic MANET On-demand (AODVv2) Routing
                        draft-ietf-manet-dymo-22

Abstract

   The Dynamic MANET On-demand (AODVv2) routing protocol is intended for
   use by mobile routers in wireless, multihop networks.  AODVv2
   determines unicast routes among AODVv2 routers within the network in
   an on-demand fashion, offering on-demand convergence in dynamic
   topologies.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on September 13, 2012.

Copyright Notice

   Copyright (c) 2012 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as



Perkins & Chakeres     Expires September 13, 2012               [Page 1]

Internet-Draft                   AODVv2                       March 2012


   described in the Simplified BSD License.


Table of Contents

   1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Applicability Statement  . . . . . . . . . . . . . . . . . . .  4
   3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Data Structures  . . . . . . . . . . . . . . . . . . . . . . .  7
     4.1.  Route Table Entry  . . . . . . . . . . . . . . . . . . . .  7
     4.2.  AODVv2 Messages  . . . . . . . . . . . . . . . . . . . . .  8
       4.2.1.  Generalized Packet and Message Structure . . . . . . .  9
       4.2.2.  Routing Message (RteMsg) - RREQ and RREP . . . . . . . 10
       4.2.3.  Route Error (RERR) . . . . . . . . . . . . . . . . . . 11
   5.  Detailed Operation . . . . . . . . . . . . . . . . . . . . . . 12
     5.1.  AODVv2 Sequence Numbers  . . . . . . . . . . . . . . . . . 12
       5.1.1.  Maintaining A Node's Own Sequence Number . . . . . . . 12
       5.1.2.  Numerical Operations on OwnSeqNum  . . . . . . . . . . 13
       5.1.3.  OwnSeqNum Rollover . . . . . . . . . . . . . . . . . . 13
       5.1.4.  Actions After OwnSeqNum Loss . . . . . . . . . . . . . 13
     5.2.  AODVv2 Routing Table Operations  . . . . . . . . . . . . . 13
       5.2.1.  Judging Routing Information's Usefulness . . . . . . . 13
       5.2.2.  Creating or Updating a Route Table Entry with
               Received Preferable Routing Information  . . . . . . . 15
       5.2.3.  Route Table Entry Timeouts . . . . . . . . . . . . . . 16
     5.3.  Routing Messages . . . . . . . . . . . . . . . . . . . . . 16
       5.3.1.  RREQ Creation  . . . . . . . . . . . . . . . . . . . . 16
       5.3.2.  RREP Creation  . . . . . . . . . . . . . . . . . . . . 17
       5.3.3.  RteMsg Handling  . . . . . . . . . . . . . . . . . . . 18
     5.4.  Route Discovery  . . . . . . . . . . . . . . . . . . . . . 21
     5.5.  Route Maintenance  . . . . . . . . . . . . . . . . . . . . 22
       5.5.1.  Active Next-hop Router Adjacency Monitoring  . . . . . 22
       5.5.2.  Updating Route Lifetimes During Packet Forwarding  . . 23
       5.5.3.  RERR Generation  . . . . . . . . . . . . . . . . . . . 23
       5.5.4.  RERR Handling  . . . . . . . . . . . . . . . . . . . . 24
     5.6.  Unknown Message and TLV Types  . . . . . . . . . . . . . . 25
     5.7.  Advertising Network Addresses  . . . . . . . . . . . . . . 25
     5.8.  Simple Internet Attachment . . . . . . . . . . . . . . . . 25
     5.9.  Multiple Interfaces  . . . . . . . . . . . . . . . . . . . 27
     5.10. AODVv2 Control Packet/Message Generation Limits  . . . . . 27
   6.  Administratively Configured Parameters and Timer Values  . . . 27
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 29
     7.1.  AODVv2 Message Types Specification . . . . . . . . . . . . 30
     7.2.  Message and Address Block TLV Type Specification . . . . . 30
     7.3.  Address Block TLV Specification  . . . . . . . . . . . . . 31
   8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 31
   9.  Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 32
   10. References . . . . . . . . . . . . . . . . . . . . . . . . . . 33



Perkins & Chakeres     Expires September 13, 2012               [Page 2]

Internet-Draft                   AODVv2                       March 2012


     10.1. Normative References . . . . . . . . . . . . . . . . . . . 33
     10.2. Informative References . . . . . . . . . . . . . . . . . . 33
   Appendix A.  Changes since the Previous Version  . . . . . . . . . 34
   Appendix B.  Proposed additional changes for LOADng conformance  . 34
   Appendix C.  Shifting Responsibility for an Address Between
                AODVv2 Routers  . . . . . . . . . . . . . . . . . . . 35
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 35












































Perkins & Chakeres     Expires September 13, 2012               [Page 3]

Internet-Draft                   AODVv2                       March 2012


1.  Overview

   The Dynamic MANET On-demand (AODVv2) routing protocol enables on-
   demand, multihop unicast routing among participating AODVv2 routers.
   The basic operations of the AODVv2 protocol are route discovery and
   route maintenance.  Route discovery is performed when an AODVv2
   router receives a packet from a node under its responsibility to a
   destination for which it does not have a route.  Route maintenance is
   performed to help ensure that the route being used to forward packets
   from the source to the destination remains operational.

   During route discovery, the originator's AODVv2 router initiates
   dissemination of a Route Request (RREQ) throughout the network to
   find a route to a particular destination, via the AODVv2 router
   responsible for this destination.  During this hop-by-hop
   dissemination process, each intermediate AODVv2 router records a
   route to the originator.  When the target's AODVv2 router receives
   the RREQ, it responds with a Route Reply (RREP) sent hop-by-hop
   toward the originating AODVv2 router.  Each intermediate AODVv2
   router that receives the RREP creates a route to the target, and then
   the RREP is unicast hop-by-hop toward the originator.  When the
   originator's AODVv2 router receives the RREP, routes have then been
   established between the originating AODVv2 router and the target
   AODVv2 router in both directions.

   Route maintenance consists of two operations.  In order to preserve
   routes in use, AODVv2 routers extend route lifetimes upon
   successfully forwarding a packet.  In order to react to changes in
   the network topology, AODVv2 routers monitor traffic being forwarded.
   When a data packet is received for forwarding and a route for the
   destination is not known or the route is broken, then the AODVv2
   router of the source of the packet is notified.  A Route Error (RERR)
   is sent toward the packet source to indicate the route to particular
   destination addresses is invalid or missing.  When the source's
   AODVv2 router receives the RERR, it deletes the route.  If this
   source's AODVv2 router later receives a packet for forwarding to the
   same destination, it will need to perform route discovery again for
   that destination.

   AODVv2 uses sequence numbers to ensure loop freedom [Perkins99].
   Sequence numbers enable AODVv2 routers to determine the temporal
   order of AODVv2 route discovery messages, thereby avoiding use of
   stale routing information.


2.  Applicability Statement

   The AODVv2 routing protocol is designed for stub or disconnected



Perkins & Chakeres     Expires September 13, 2012               [Page 4]

Internet-Draft                   AODVv2                       March 2012


   mobile ad hoc networks (MANETs).  AODVv2 handles a wide variety of
   mobility patterns by dynamically determining routes on-demand.
   AODVv2 also handles a wide variety of traffic patterns.  In networks
   with a large number of routers, AODVv2 is best suited for sparse
   traffic scenarios where routers forward packets to only a small
   portion of the other AODVv2 routers, due to the on-demand nature of
   route discovery and route maintenance.

   AODVv2 is applicable to memory constrained devices, since little
   routing state is maintained in each AODVv2 router.  Only routing
   information related to active sources and destinations is maintained,
   in contrast to most proactive routing protocols that require routing
   information to all routers within the routing region be maintained.

   AODVv2 supports routers with multiple interfaces participating in the
   MANET.  AODVv2 routers can also perform routing on behalf of other
   nodes, attached via participating or non-participating interfaces.

   AODVv2 routers perform route discovery to find a route to a
   particular destination.  Therefore, AODVv2 routers MUST be configured
   to initiate and respond to route discovery on behalf of certain
   nodes, identified by address.  When AODVv2 is the only protocol
   interacting with the forwarding table, AODVv2 MAY be configured to
   perform route discovery for all unknown unicast destinations.

   At any time within an AODVv2 routing region, only one AODVv2 router
   SHOULD be responsible for, i.e. "own", any particular address.
   Coordination among multiple AODVv2 routers to distribute routing
   information correctly for a shared address (i.e. an address that is
   advertised and can be reached via multiple AODVv2 routers) is not
   described in this document.  The router behavior for shifting
   responsibility for an address from one AODVv2 router to another is
   mentioned in Appendix C.

   AODVv2 only utilizes bidirectional links.  In the case of possible
   unidirectional links, either blacklists (see Section 7.2) or other
   means (e.g. adjacency establishment with only neighboring routers
   that have bidirectional communication as indicated by NHDP
   [I-D.ietf-manet-nhdp]) of ensuring and monitoring bi-directionality
   is recommended.  Otherwise, persistent packet loss may occur.

   The routing algorithm in AODVv2 may be operated at layers other than
   the network layer, using layer-appropriate addresses.


3.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",



Perkins & Chakeres     Expires September 13, 2012               [Page 5]

Internet-Draft                   AODVv2                       March 2012


   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   Additionally, this document uses some terminology from [RFC5444].

   This document defines the following terminology:

   Adjacency
      A relationship between selected bi-directional neighboring routers
      for the purpose of exchanging routing information.  Not every pair
      of neighboring routers will necessarily form an adjacency.
      Neighboring routers may form an adjacency based several different
      pieces of information or protocols; for example, exchange of
      AODVv2 routing messages, other protocols (e.g.  NDP [RFC4861] or
      NHDP [I-D.ietf-manet-nhdp]), or manual configuration.  Similarly,
      loss of a routing adjacency may also be based upon several pieces
      of information, and monitoring of adjacencies where packets are
      being forwarded is required (see Section 5.5.1).

   Distance (Dist)
      A metric of the distance a message or piece of information has
      traversed.  The minimum value of distance is the number of IP hops
      traversed.  The maximum value is 65,535.

   AODVv2 Sequence Number (SeqNum)
      An AODVv2 Sequence Number is maintained by each AODVv2 router
      process.  This sequence number is used by other AODVv2 routers to
      identify the temporal order of routing information generated and
      ensure loop-free routes.

   Multihop-capable Unicast IP Address
      A multihop-capable unicast IP address is a unicast IP address that
      when put into the IP.SourceAddress or IP.DestinationAddress field
      is scoped sufficiently to be forwarded by a router.  Globally-
      scoped unicast IP addresses and Unique Local Addresses (ULAs) are
      examples of multihop-capable unicast IP addresses.

   Originating Node (OrigNode)
      The originating node is the source, its AODVv2 router creates a
      AODVv2 control message on its behalf in an effort to disseminate
      some routing information.  The originating node is also referred
      to as a particular message's originator.

   Route Error (RERR)
      A RERR message is used to indicate that an AODVv2 router does not
      have a forwarding route to one or more particular addresses.





Perkins & Chakeres     Expires September 13, 2012               [Page 6]

Internet-Draft                   AODVv2                       March 2012


   Route Reply (RREP)
      A RREP message is used to disseminate routing information about
      the RREP TargetNode to the RREP OrigNode and the AODVv2 routers
      between them.

   Route Request (RREQ)
      A RREQ message is used to discover a valid route to a particular
      destination address, called the RREQ TargetNode.  When an AODVv2
      router processes a RREQ, it learns routing information on how to
      reach the RREQ OrigNode.

   Target Node (TargetNode)
      The TargetNode is the ultimate destination of a message.

   This Node (ThisNode)
      ThisNode corresponds to the AODVv2 router process currently
      performing a calculation or attending to a message.

   Type-Length-Value structure (TLV)
      A generic way to represent information, please see [RFC5444] for
      additional information.

   Unreachable Node (UnreachableNode)
      An UnreachableNode is a node for which a forwarding route is
      unknown.


4.  Data Structures

4.1.  Route Table Entry

   The route table entry is a conceptual data structure.
   Implementations may use any internal representation that conforms to
   the semantics of a route as specified in this document.

   Conceptually, a route table entry has the following fields:

   Route.Address
      The (host or network) destination address of the node(s)
      associated with the routing table entry.

   Route.Prefix
      Indicates that the associated address is a network address, rather
      than a host address.  The value is the length of the netmask/
      prefix.






Perkins & Chakeres     Expires September 13, 2012               [Page 7]

Internet-Draft                   AODVv2                       March 2012


   Route.SeqNum
      The AODVv2 SeqNum associated with this routing information.

   Route.NextHopAddress
      The IP address of the adjacent AODVv2 router on the path toward
      the Route.Address.

   Route.NextHopInterface
      The interface used to send packets toward the Route.Address.

   Route.Forwarding
      A flag indicating whether this Route can be used for forwarding
      data packets.  This flag MAY be provided for management and
      monitoring.

   Route.Broken
      A flag indicating whether this Route is broken.  This flag is set
      to true if the next-hop becomes unreachable or in response to
      attending to a RERR (see Section 5.5.4).

   The following field is optional:

   Route.Dist
      A dimensionless metric indicating the distance traversed before
      reaching the Route.Address node.

   Not including optional information may cause performance degradation,
   but it will not cause the protocol to operate incorrectly.

   In addition to a route table data structure, each route table entry
   may have several timers associated with the information.  These
   timers/timeouts are discussed in Section 5.2.3.

4.2.  AODVv2 Messages

   When describing AODVv2 protocol messages, it is necessary to refer to
   fields in several distinct parts of the overall packet.  These
   locations include the IP header, the UDP header, and fields from
   [RFC5444].  This document uses the following notation conventions.
   Information found in the table.











Perkins & Chakeres     Expires September 13, 2012               [Page 8]

Internet-Draft                   AODVv2                       March 2012


             +---------------------------+-------------------+
             |    Information Location   | Notational Prefix |
             +---------------------------+-------------------+
             |         IP header         |        IP.        |
             |         UDP header        |        UDP.       |
             |   RFC5444 message header  |      MsgHdr.      |
             |    RFC5444 message TLV    |      MsgTLV.      |
             |   RFC5444 address blocks  |      AddBlk.      |
             | RFC5444 address block TLV |      AddTLV.      |
             +---------------------------+-------------------+

                                  Table 1

4.2.1.  Generalized Packet and Message Structure

   AODVv2 messages conform to the generalized packet and message format
   as described in [RFC5444].  Here is a brief description of the
   format.  A packet is made up of messages.  A message is made up of a
   message header, message TLV block, and zero or more address blocks.
   Each of the address blocks may also have an associated address TLV
   block.

   For interoperability with other AODVv2 routers, all AODVv2 messages
   specified in this document SHOULD sent using the IP protocol number
   (138) reserved for manet protocols [RFC5498]; or the UDP destination
   port (269) reserved for manet protocols [RFC5498] and IP protocol
   number for UDP.

   Most AODVv2 messages are sent with the IP destination address set to
   the link-local multicast address LL-MANET-Routers [RFC5498] unless
   otherwise stated.  Therefore, all AODVv2 routers SHOULD subscribe to
   LL-MANET-Routers [RFC5498] for receiving control packets.  Note that
   multicast packets MAY be sent via unicast.  For example, this may
   occur for certain link-types (non broadcast mediums), improved
   robustness, or manually configured router adjacencies.

   Unicast AODVv2 messages (e.g.  RREP) unless otherwise specified in
   this document are sent with the IP destination set to the
   Route.NextHopAddress of the route to the TargetNode.

   The IPv4 TTL (IPv6 Hop Limit) field for all packets containing AODVv2
   messages is set to 255.  If a packet is received with a value other
   than 255, it is discarded.  This mechanism helps to ensures that
   packets have not passed through any intermediate routers, and it is
   known as GTSM [RFC5082].

   The length of an address (32 bits for IPv4 and 128 bits for IPv6)
   inside an AODVv2 message depends on the msg-addr-length (MAL) in the



Perkins & Chakeres     Expires September 13, 2012               [Page 9]

Internet-Draft                   AODVv2                       March 2012


   msg-header, as specified in [RFC5444].

   AODVv2 control packets SHOULD be given priority queuing and channel
   access.

4.2.2.  Routing Message (RteMsg) - RREQ and RREP

   Routing Messages (RteMsgs) are used to disseminate routing
   information.  There are two AODVv2 message types that are considered
   to be routing messages (RteMsgs): RREQ and RREP.  They contain very
   similar information and function, but have slightly different
   handling rules.  The main difference between the two messages is that
   RREQ messages generally solicit a RREP, whereas a RREP is the
   response to RREQ.

   RteMsg creation and handling are described in Section 5.3.

   A RteMsg requires the following information:

   IP.SourceAddress
      The IP address of the node currently sending this packet.  This
      field is generally filled automatically by the operating system
      and should not require special handling.

   IP.DestinationAddress
      The IP address of the packet destination.  For multicast RREQ the
      IP.DestinationAddress is set to LL-MANET-Routers [RFC5498].  For
      unicast RREP the IP.DestinationAddress is set to the
      NextHopAddress toward the RREP TargetNode.

   IP.ProtocolNumber and UDP.DestinationPort
      The IP Protocol Number 138 (manet) has been reserved for MANET
      protocols [RFC5498].  In addition to using this IP protocol
      number, AODVv2 may use the UDP port 269 (manet) [RFC5498] in
      conjunction with the IP Protocol Number 17 (UDP).

   MsgHdr.HopLimit
      The remaining number of hops this message is allowed to traverse.

   AddBlk.TargetNode.Address
      The IP address of the message TargetNode.  In a RREQ the
      TargetNode is the destination address for which route discovery is
      being performed.  In a RREP the TargetNode is the RREQ OrigNode
      address.  The TargetNode address is the first address in a routing
      message.






Perkins & Chakeres     Expires September 13, 2012              [Page 10]

Internet-Draft                   AODVv2                       March 2012


   AddBlk.OrigNode.Address
      The IP address of the originator and its associated prefix length.
      In a RREQ the OrigNode is the source's address and prefix.  In a
      RREP the OrigNode is the RREQ TargetNode's address and prefix for
      which a RREP is being generated.  This address is the second
      address in the message for RREQ.

   OrigNode.AddTLV.SeqNum
      The AODVv2 sequence number of the originator's AODVv2 router.

   A RteMsg may optionally include the following information:

   TargetNode.AddTLV.SeqNum
      The last known AODVv2 sequence number of the TargetNode.

   TargetNode.AddTLV.Dist
      The last known Distance to the TargetNode.

   AddBlk.AdditionalNode.Address
      The IP address of an additional node that can be reached via the
      AODVv2 router adding this information.  Each
      AdditionalNode.Address MUST include its prefix.  Each
      AdditionalNode.Address MUST also have an associated Node.SeqNum in
      the address TLV block.

   AdditionalNode.AddTLV.SeqNum
      The AODVv2 sequence number associated with this routing
      information.

   OrigNode.AddTLV.Dist
      A metric of the distance to reach the associated OrigNode.Address.
      This field is incremented by at least one at each intermediate
      AODVv2 router.

   AdditionalNode.AddTLV.Dist
      A metric of the distance to reach the associated
      AdditionalNode.Address.  This field is incremented by at least one
      at each intermediate AODVv2 router.

4.2.3.  Route Error (RERR)

   A RERR message is used to disseminate the information that a route is
   not available for one or more particular addresses.

   RERR creation and handling are described in Section 5.5.

   A RERR requires the following information:




Perkins & Chakeres     Expires September 13, 2012              [Page 11]

Internet-Draft                   AODVv2                       March 2012


   IP.SourceAddress
      The IP address of the AODVv2 router that sent this packet.  This
      field is generally filled automatically by the operating system
      and should not require special handling.

   IP.DestinationAddress
      For multicast RERR messages, The IP address is set to LL-MANET-
      Routers [RFC5498].  For unicast RERR messages, the IP address is
      set to the NextHopAddress.

   IP.ProtocolNumber and UDP.DestinationPort
      The IP Protocol Number 138 (manet) has been reserved for MANET
      protocols [RFC5498].  In addition to using this IP protocol
      number, AODVv2 may use the UDP port 269 (manet) [RFC5498] in
      conjunction with the IP Protocol Number 17 (UDP).

   MsgHdr.HopLimit
      The remaining number of hops this message is allowed to traverse.

   AddBlk.UnreachableNode.Address
      The address of an UnreachableNode and its associated prefix
      length.  Multiple unreachable addresses may be included in a RERR.

   A Route Error may optionally include the following information:

   UnreachableNode.AddTLV.SeqNum
      The last known AODVv2 sequence number of the unreachable node.  If
      a SeqNum for an address is zero (0) or not included, it is assumed
      to be unknown.  This case occurs when a node receives a message to
      forward to a destination for which it does not have any
      information in its routing table.


5.  Detailed Operation

5.1.  AODVv2 Sequence Numbers

   AODVv2 sequence numbers allow AODVv2 routers to judge the freshness
   of routing information and ensure loop freedom.

5.1.1.  Maintaining A Node's Own Sequence Number

   AODVv2 requires that each AODVv2 router in the network maintain its
   own AODVv2 sequence number (OwnSeqNum) on behalf of the addresses for
   which it is responsible.  OwnSeqNum a 16-bit unsigned integer.  The
   circumstances for ThisNode to increment its OwnSeqNum are described
   in Section 5.3.




Perkins & Chakeres     Expires September 13, 2012              [Page 12]

Internet-Draft                   AODVv2                       March 2012


5.1.2.  Numerical Operations on OwnSeqNum

   When ThisNode increments its OwnSeqNum it MUST do so by treating the
   sequence number value as an unsigned number.

5.1.3.  OwnSeqNum Rollover

   Incrementing an OwnSeqNum whose value is the largest largest possible
   number representable as a 16-bit unsigned integer (i.e., 65,535),
   SHOULD be set to one (1).  In other words, the sequence number after
   65,535 is 1.

5.1.4.  Actions After OwnSeqNum Loss

   An AODVv2 router SHOULD maintain its sequence number in persistent
   storage.

   If an AODVv2 router's OwnSeqNum is lost, it MUST take certain actions
   to avoid creating routing loops.  To prevent this possibility after
   OwnSeqNum loss an AODVv2 router MUST wait for at least
   ROUTE_DELETE_TIMEOUT before fully participating in the AODVv2 routing
   protocol.  If an AODVv2 control message is received during this
   waiting period, the AODVv2 router SHOULD handle it normally but MUST
   NOT transmit or retransmit any AODVv2 messages.  If a data packet is
   received for forwarding to another destination during this waiting
   period, the AODVv2 router MUST generate a RERR message indicating
   that this route is not available and reset its waiting timeout.  At
   the end of the waiting period the AODVv2 router sets its OwnSeqNum to
   one (1) and begins participating.

   The longest a node need wait is ROUTE_SEQNUM_AGE_MAX_TIMEOUT.  At the
   end of the maximum waiting period a node SHOULD set its OwnSeqNum to
   one (1) and begins participating.

5.2.  AODVv2 Routing Table Operations

5.2.1.  Judging Routing Information's Usefulness

   Given a route table entry (Route.SeqNum, Route.Dist, and
   Route.Broken) and new incoming routing information for a particular
   node in a RteMsg (Node.SeqNum, Node.Dist, and RteMsg message type -
   RREQ/RREP), the quality of the new routing information is evaluated
   to determine its usefulness.  Incoming routing information is
   classified as follows:







Perkins & Chakeres     Expires September 13, 2012              [Page 13]

Internet-Draft                   AODVv2                       March 2012


   1. Stale
      If Node.SeqNum - Route.SeqNum < 0 (using signed 16-bit arithmetic)
      the incoming information is stale.  Using stale routing
      information is not allowed, since doing so might result in routing
      loops.

      (Node.SeqNum - Route.SeqNum < 0)
          using signed 16-bit arithmetic

   2. Loop-possible
      If Node.SeqNum == Route.SeqNum the incoming information may cause
      loops if used; in this case additional information MUST be
      examined.  If Route.Dist or Node.Dist is unknown or zero (0), then
      the routing information is loop-possible.  If Node.Dist >
      Route.Dist + 1, then the routing information is loop-possible.
      Using loop-possible routing information is not allowed, otherwise
      routing loops may be formed.

      (Node.SeqNum == Route.SeqNum) AND
      ((Node.Dist is unknown) OR
       (Route.Dist is unknown) OR
       (Node.Dist > Route.Dist + 1))

   3. Disfavored or equivalent
      In case of known equal SeqNum, the information is disfavored in
      multiple cases: (case i) if Node.Dist == Route.Dist + 1 (it is a
      greater distance route) AND Route.Broken == false; (case ii) if
      Node.Dist == Route.Dist (equal distance route) AND Route.Broken ==
      false AND this RteMsg is a RREQ.  This condition reduces the
      number of RREQ flooded by stopping forwarding of RREQ with
      equivalent distance.

      ((Node.SeqNum == Route.SeqNum) AND
       (((Node.Dist == Route.Dist + 1) AND (Route.Broken == false)) OR
        ((Node.Dist == Route.Dist) AND
         (RteMsg is RREQ) AND (Route.Broken == false))))

   4. Preferable
      Incoming routing information that does not match any of the above
      criteria is loop-free and better than the information existing in
      the routing table.  Information is always preferable if
      Node.SeqNum - Route.SeqNum > 0 (using signed 16-bit arithmetic).
      In the case of equal sequence numbers, the information is
      preferable in multiple cases: (case i) if Node.Dist < Route.Dist;
      (case ii) if Node.Dist == Route.Dist + 1 AND Route.Broken == true
      (a broken route is being repaired); (case iii) if Node.Dist ==
      Route.Dist AND it is a RREP (RREP with equal distance are
      forwarded) OR Route.Broken == true (a broken route is being



Perkins & Chakeres     Expires September 13, 2012              [Page 14]

Internet-Draft                   AODVv2                       March 2012


      repaired).  For completeness, we provide the following (optimized)
      pseudo-code.

      (Node.SeqNum - Route.SeqNum > 0) OR
          using signed 16-bit arithmetic
      ((Node.SeqNum == Route.SeqNum) AND
       ((Node.Dist < Route.Dist) OR
        ((Node.Dist == Route.Dist + 1) AND (Route.Broken == true)) OR
        ((Node.Dist == Route.Dist) AND
         ((RteMsg is RREP) OR (Route.Broken == true)))))

5.2.2.  Creating or Updating a Route Table Entry with Received
        Preferable Routing Information

   The route table entry is populated with the following information:

   1.  the Route.Address is set to Node.Address,

   2.  the Route.Prefix is set to the Node.Prefix.

   3.  the Route.SeqNum is set to the Node.SeqNum,

   4.  the Route.NextHopAddress is set to the node that transmitted this
       AODVv2 RteMsg packet (i.e., the IP.SourceAddress),

   5.  the Route.NextHopInterface is set to the interface that this
       AODVv2 packet was received on,

   6.  the Route.Broken flag is set to false,

   7.  if known, the Route.Dist is set to the Node.Dist,

   Fields without known values are not populated with any value.

   The timer for the minimum delete timeout (ROUTE_AGE_MIN) is set to
   ROUTE_AGE_MIN_TIMEOUT.  The timer for the maximum delete timeout
   (ROUTE_SEQNUM_AGE_MAX) is set to Node.AddTLV.VALIDITY_TIME [RFC5497]
   if included; otherwise, ROUTE_SEQNUM_AGE_MAX is set to
   ROUTE_SEQNUM_AGE_MAX_TIMEOUT.  The usage of these timers and others
   are described in Section 5.2.3.

   At this point, a forwarding route has been created and the
   Route.Forwarding flag set.  Afterward, the route can be used to send
   any queued data packets and forward any incoming data packets for
   Route.Address.  This route also fulfills any outstanding route
   discovery attempts for Node.Address.





Perkins & Chakeres     Expires September 13, 2012              [Page 15]

Internet-Draft                   AODVv2                       March 2012


5.2.3.  Route Table Entry Timeouts

5.2.3.1.  Minimum Delete Timeout (ROUTE_AGE_MIN)

   When an AODVv2 router transmits a RteMsg, other AODVv2 routers expect
   the transmitting AODVv2 router to have a forwarding route to the
   RteMsg originator.  After updating a route table entry, it SHOULD be
   maintained for at least ROUTE_AGE_MIN.  Failure to maintain the
   information might result in lost messages/packets, or in the worst
   case scenario several duplicate messages.

   After the ROUTE_AGE_MIN timeout a route can safely be deleted.

5.2.3.2.  Maximum Sequence Number Delete Timeout (ROUTE_SEQNUM_AGE_MAX)

   Sequence number information is time sensitive, and MUST be deleted
   after a time in order to ensure loop-free routing.

   After the ROUTE_SEQNUM_AGE_MAX timeout a route's sequence number
   information MUST be discarded.

5.2.3.3.  Recently Used Timeout (ROUTE_USED)

   When a route is used to forward data packets, this timer is set to
   expire after ROUTE_USED_TIMEOUT.  This operation is also discussed in
   Section 5.5.2.

   If a route has not been used recently, then a timer for ROUTE_DELETE
   is set to ROUTE_DELETE_TIMEOUT.

5.2.3.4.  Delete Information Timeout (ROUTE_DELETE)

   As time progresses the likelihood that old routing information is
   useful decreases, especially if the network nodes are mobile.
   Therefore, old information SHOULD be deleted.

   After the ROUTE_DELETE timeout if a forwarding route exists it SHOULD
   be removed, and the routing table entry SHOULD also be deleted.

5.3.  Routing Messages

5.3.1.  RREQ Creation

   Before an AODVv2 router creates a RREQ it SHOULD increment its
   OwnSeqNum by one (1) according to the rules specified in Section 5.1.
   Incrementing OwnSeqNum will ensure that all nodes with existing
   routing information will consider this new information preferable to
   existing routing table information.  If the sequence number is not



Perkins & Chakeres     Expires September 13, 2012              [Page 16]

Internet-Draft                   AODVv2                       March 2012


   incremented, certain AODVv2 routers might not consider this
   information preferable, if they have existing better routing
   information.

   First, ThisNode adds the AddBlk.TargetNode.Address to the RREQ; the
   unicast IP Destination Address for which a forwarding route does not
   exist.

   If a previous value of the TargetNode.SeqNum is known (from a routing
   table entry using longest-prefix matching), it SHOULD be placed in
   TargetNode.AddTLV.SeqNum in all but the last RREQ attempt.  If a
   TargetNode.SeqNum is not included, it is assumed to be unknown by
   handling nodes.  This operation ensures that no intermediate AODVv2
   routers reply, and ensures that the TargetNode's AODVv2 router
   increments its sequence number.

   Next, the node adds AddBlk.OrigNode.Address, its prefix, and the
   OrigNode.AddTLV.SeqNum (OwnSeqNum) to the RteMsg.

   The OrigNode.Address is the address of the source for which this
   AODVv2 router is initiating this route discovery.  The
   OrigNode.Address MUST be a unicast address.  This information will be
   used by nodes to create a route toward the OrigNode, enabling
   delivery of a RREP, and eventually used for proper forwarding of data
   packets.

   If OrigNode.Dist is included it is set to a number greater than zero
   (0).

   The MsgHdr.HopLimit SHOULD be set to MSG_HOPLIMIT.

   For RREQ, the MsgHdr.HopLimit MAY be set in accordance with an
   expanding ring search as described in [RFC3561] to limit the RREQ
   propagation to a subset of the local network and possibly reduce
   route discovery overhead.

   The IP.DestinationAddress for multicast RREQ is set to LL-MANET-
   Routers.  For links that do not support multicast or situations in
   which unicast messaging is preferred, the IP.DestinationAddress for
   unicast RREQ is set to the NextHopAddress.

5.3.2.  RREP Creation

   First, the AddBlk.TargetNode.Address is added to the RREP.  The
   TargetNode is the ultimate destination of this RREP; the RREQ
   OrigNode.Address.

   Next, AddBlk.OrigNode.Address and prefix are added to the RREP.  The



Perkins & Chakeres     Expires September 13, 2012              [Page 17]

Internet-Draft                   AODVv2                       March 2012


   AddBlk.OrigNode.Address is the RREQ TargetNode.Address.  The
   AddBlk.OrigNode.Address MUST be a unicast IP address.  ThisNode
   SHOULD advertise the largest known prefix containing
   AddBlk.OrigNode.Address.

   When the RteMsg TargetNode's AODVv2 router creates a RREP, if the
   TargetNode.SeqNum was not included in the RREQ, ThisNode MUST
   increment its OwnSeqNum by one (1) according to the rules specified
   in Section 5.1.

   If TargetNode.SeqNum was included in the RteMsg and TargetNode.SeqNum
   - OwnSeqNum < 0 (using signed 16-bit arithmetic), OwnSeqNum SHOULD be
   incremented by one (1) according to the rules specified in
   Section 5.1.

   If TargetNode.SeqNum is included in the RteMsg and TargetNode.SeqNum
   == OwnSeqNum (using signed 16-bit arithmetic) and OrigNode.Dist will
   not be included in the RREP being generated, OwnSeqNum SHOULD be
   incremented by one (1) according to the rules specified in
   Section 5.1.

   If OwnSeqNum is not incremented the routing information might be
   considered stale.  In this case, the RREP might not reach the RREP
   Target.

   After any of the sequence number operations above, the RREP
   OrigNode.AddTLV.SeqNum (OwnSeqNum) MUST also be added to the RREP.

   Other AddTLVs in the RREP for the OrigNode and TargetNode SHOULD be
   included and set accordingly.  If OrigNode.Dist is included it is set
   to a number greater than zero (0) and less than or equal to 65,535.
   The Distance value will influence judgment of the routing information
   (Section 5.2.1) against known information at other AODVv2 routers
   that handle this RteMsg.

   The MsgHdr.HopLimit is set to MSG_HOPLIMIT.

   The IP.DestinationAddress for RREP is set to the IP address of the
   Route.NextHopAddress for the route to the RREP TargetNode.

5.3.3.  RteMsg Handling

   First, ThisNode examines the RteMsg to ensure that it contains the
   required information: MsgHdr.HopLimit, AddBlk.TargetNode.Address,
   AddBlk.OrigNode.Address, and OrigNode.AddTLV.SeqNum.  If the required
   information do not exist, the message is discarded and further
   processing stopped.




Perkins & Chakeres     Expires September 13, 2012              [Page 18]

Internet-Draft                   AODVv2                       March 2012


   Next, ThisNode MAY selectively attend to messages based upon
   information in the message.  ThisNode SHOULD only handle messages
   from adjacent AODVv2 routers.  If ThisNode chooses not to handle this
   message, the message is discarded and further processing stopped.

   ThisNode checks if the AddBlk.OrigNode.Address is a valid multihop-
   capable (e.g. site or global scope) unicast address.  If the address
   is not a valid unicast address, the message is discarded and further
   processing stopped.

   ThisNode also checks whether AddBlk.OrigNode.Address is an address
   handled by this AODVv2 router.  If this node is the originating
   AODVv2 router, the RteMsg is dropped.

   ThisNode checks if the AddBlk.TargetNode.Address is a valid multihop-
   capable unicast address.  If the address is not a valid unicast
   address, the message is discarded and further processing stopped.

   Next, ThisNode checks whether its routing table has an entry to the
   AddBlk.OrigNode.Address using longest-prefix matching [RFC1812].  If
   a route with a valid Route.SeqNum does not exist, then the new
   routing information is considered preferable and a new route table
   entry is created and updated as described in Section 5.2.2.  If a
   route table entry does exists and it has a known Route.SeqNum, the
   incoming routing information is compared with the route table entry
   following the procedure described in Section 5.2.1.  If the incoming
   routing information is considered preferable, the route table entry
   is updated as described in Section 5.2.2.

   For each address (except the TargetNode) in the RteMsg that includes
   AddTLV.Dist information, the AddTLV.Dist information MAY be
   incremented.  If the resulting Distance value for the OrigNode is
   greater than 65,535, the message is discarded.  If the resulting
   Distance value for another node is greater than 65,535, the
   associated address and its information are removed from the RteMsg.
   The updated Distance value will influence judgment of the routing
   information (Section 5.2.1).

   After handling the OrigNode's routing information, then each address
   that is not the TargetNode MAY be considered for creating and
   updating routes.  Creating and updating routes to other nodes can
   eliminate RREQ for those IP destinations, in the event that data
   needs to be forwarded to the IP destination(s) now or in the near
   future.

   For each of the additional addresses considered, ThisNode first
   checks the that the address is a multihop-capable unicast address.
   If the address is not a unicast address, the address and all related



Perkins & Chakeres     Expires September 13, 2012              [Page 19]

Internet-Draft                   AODVv2                       March 2012


   information MUST be removed.

   If the routing table does not have a matching route with a known
   Route.SeqNum for this additional address using longest-prefix
   matching, then a route is created and updated as described in
   Section 5.2.2.  If a route table entry exists with a known
   Route.SeqNum, the incoming routing information is compared with the
   route table entry following the procedure described in Section 5.2.1.
   If the incoming routing information is considered preferable, the
   route table entry is updated as described in Section 5.2.2.

   If the routing information for an AdditionalNode.Address is not
   considered preferable, then it is removed from the RteMsg.  Removing
   this information ensures that the information is not propagated.

   At this point, if the routing information for the OrigNode was not
   preferable then this RteMsg SHOULD be discarded and no further
   processing of this message SHOULD be performed.

   If the ThisNode is the AODVv2 router responsible for the TargetNode
   and this RteMsg is a RREQ, then ThisNode responds with a RREP to the
   RREQ OrigNode (the new RREP's TargetNode).  The procedure for issuing
   a new RREP is described in Section 5.3.2.  At this point, ThisNode
   need not perform any more operations for the RteMsg being processed.

   As an alternative to issuing a RREP, ThisNode MAY choose to
   distribute routing information about ThisNode (the RREQ TargetNode)
   more widely.  That is, ThisNode MAY optionally perform a route
   discovery; by issuing a RREQ with ThisNode listed as the TargetNode,
   using the procedure in Section 5.3.1.  At this point, ThisNode need
   not perform any more operations for the RteMsg being processed.

   If the resulting Distance value for the OrigNode is greater than
   65,535, the message is discarded.  If the resulting Distance value
   for another node is greater than 65,535, the associated address and
   its information are removed from the RteMsg.

   Next, the MsgHdr.HopLimit is decremented by one (1).  If this
   RteMsg's MsgHdr.HopLimit is greater than or equal to one (1),
   ThisNode is not the TargetNode, AND this RteMsg is a RREQ, then the
   current RteMsg (altered by the procedure defined above) SHOULD be
   sent to the IP.DestinationAddress LL-MANET-Routers [RFC5498].  If the
   RREQ is unicast, the IP.DestinationAddress is set to the
   NextHopAddress.

   If this RteMsg's MsgHdr.HopLimit is greater than or equal to one (1),
   ThisNode is not the TargetNode, AND this RteMsg is a RREP, then the
   current RteMsg is sent to the Route.NextHopAddress for the RREP's



Perkins & Chakeres     Expires September 13, 2012              [Page 20]

Internet-Draft                   AODVv2                       March 2012


   TargetNode.Address.  If no forwarding route exists to
   TargetNode.Address, then a RERR SHOULD be issued to the OrigNode of
   the RREP.

   By sending the updated RteMsg, ThisNode advertises that it will route
   for addresses contained in the outgoing RteMsg based on the
   information enclosed.  ThisNode MAY choose not to send the RteMsg,
   though not resending this RteMsg could decrease connectivity in the
   network or result in a non-shortest distance path.

   Some examples of why ThisNode might choose to not re-issue a RteMsg
   are: if ThisNode does not want to advertise routing for the contained
   addresses because it is already heavily loaded; if ThisNode has
   already issued nearly identical routing information (e.g.  ThisNode
   had recently issued a RteMsg with nearly the same distance); or if
   ThisNode is low on energy and does not want to expend energy for
   control message sending or packet forwarding.  The exact
   circumstances producing such behavior are not specified in this
   document.

5.4.  Route Discovery

   When a source's AODVv2 router needs to forward a data packet on
   behalf of an attached node and it does not have a forwarding route to
   the data packet's unicast IP destination address, ThisNode sends a
   RREQ (described in Section 5.3.1) to discover a route to the
   particular destination (TargetNode).

   After issuing a RREQ, the OrigNode AODVv2 router waits for a route to
   be created to the TargetNode.  If a route is not created within
   RREQ_WAIT_TIME, ThisNode may again try to discover a route by issuing
   another RREQ using the procedure defined in Section 5.3.1 again.
   Route discovery SHOULD be considered failed after
   DISCOVERY_ATTEMPTS_MAX and the final RREQ's corresponding
   RREQ_WAIT_TIME.

   To reduce congestion in a network, repeated attempts at route
   discovery for a particular TargetNode SHOULD utilize an exponential
   backoff.

   For example, the first time an AODVv2 router issues a RREQ, it waits
   RREQ_WAIT_TIME for a route to the TargetNode.  If a route is not
   found within that time, the AODVv2 router MAY send another RREQ.  If
   a route is not found within two (2) times the current waiting time,
   another RREQ MAY be sent.  No more than DISCOVERY_ATTEMPTS_MAX route
   discovery attempts SHOULD be made before considering route discovery
   for this destination to have failed.  For each additional attempt,
   the waiting time for the previous RREQ is multiplied by two (2) so



Perkins & Chakeres     Expires September 13, 2012              [Page 21]

Internet-Draft                   AODVv2                       March 2012


   that the waiting time conforms to a binary exponential backoff.

   Data packets awaiting a route SHOULD be buffered by the source's
   AODVv2 router.  This buffer SHOULD have a fixed limited size
   (BUFFER_SIZE_PACKETS or BUFFER_SIZE_BYTES) and older data packets
   SHOULD be discarded first.

   Buffering of data packets can have both positive and negative
   effects, and therefore buffer settings (BUFFER_DURING_DISCOVERY)
   SHOULD be administratively configurable or intelligently controlled.

   If a route discovery attempt has failed (i.e. an attempt or multiple
   attempts have been made without receiving a RREP) to find a route to
   the TargetNode, any data packets buffered for the corresponding
   TargetNode are dropped and a Destination Unreachable ICMP message
   SHOULD be delivered to the source.

5.5.  Route Maintenance

   A RERR SHOULD be issued if a data packet is to be forwarded and it
   cannot be delivered to the next-hop because no forwarding route for
   the IP.DestinationAddress exists; RERR generation is described in
   Section 5.5.3.

   Upon this condition, an ICMP Destination Unreachable message SHOULD
   NOT be generated unless this router is responsible for the
   IP.DestinationAddress and that IP.DestinationAddress is known to be
   unreachable.

   In addition to inability to forward a data packet, a RERR SHOULD be
   issued immediately after detecting a broken link (see Section 5.5.1)
   of a forwarding route to quickly notify AODVv2 routers that certain
   routes are no longer available.  If a newly unavailable route has not
   been used recently (indicated by ROUTE_USED), the RERR SHOULD NOT be
   generated.

5.5.1.  Active Next-hop Router Adjacency Monitoring

   Nodes MUST monitor connectivity to adjacent next-hop AODVv2 routers
   on forwarding routes.  This monitoring can be accomplished by one or
   several mechanisms, including:

   o  Neighborhood discovery [I-D.ietf-manet-nhdp]

   o  Route timeout

   o  Lower layer feedback that a particular adjacent router is no
      longer reachable



Perkins & Chakeres     Expires September 13, 2012              [Page 22]

Internet-Draft                   AODVv2                       March 2012


   o  Other monitoring mechanisms or heuristics

   Upon determining that a next-hop AODVv2 router is unreachable,
   ThisNode MUST remove the affected forwarding routes (those with an
   unreachable next-hop) and unset the Route.Forwarding flag.  ThisNode
   also flags the associated routes in AODVv2's routing table as Broken.
   For each broken route the timer for ROUTE_DELETE is set to
   ROUTE_DELETE_TIMEOUT.

5.5.2.  Updating Route Lifetimes During Packet Forwarding

   To avoid removing the forwarding route to reach the IP.SourceAddress,
   ThisNode SHOULD set the "ROUTE_USED" timeout to the value
   ROUTE_USED_TIMEOUT for the route to the IP.SourceAddress upon
   receiving a data packet.  If the timer for ROUTE_DELETE is set, it is
   removed.

   To avoid removing the forwarding route to the IP.DestinationAddress
   that is being used, ThisNode SHOULD set the "ROUTE_USED" timeout to
   the value ROUTE_USED_TIMEOUT for the route to the
   IP.DestinationAddress upon sending a data packet.  If the timer for
   ROUTE_DELETE is set, it is removed.

5.5.3.  RERR Generation

   A RERR informs AODVv2 routers that a route to certain destinations is
   not available through ThisNode.

   When creating a new RERR, the address of the first UnreachableNode
   (IP.DestinationAddress from a data packet or RREP.TargetNode.Address)
   is inserted into an Address Block AddBlk.UnreachableNode.Address.  If
   a prefix is known for the UnreachableNode.Address, it SHOULD be
   included.  Otherwise, the UnreachableNode.Address is assumed to be a
   host address with a full length prefix.  If a value for the
   UnreachableNode's SeqNum (UnreachableNode.AddTLV.SeqNum) is known, it
   SHOULD be placed in the RERR.  The MsgHdr.HopLimit is set to
   MSG_HOPLIMIT.

   If SeqNum information is not known or not included in the RERR, all
   nodes handling the RERR will assume their routing information
   associated with the UnreachableNode is no longer valid and flag those
   routes as broken.

   A multicast RERR is sent to the IP.DestinationAddress LL-MANET-
   Routers [RFC5498].  Sending the RERR to the LL-MANET-Routers address
   notifies all nearby AODVv2 routers that might depend on the now
   broken link.  If the RERR is unicast, the IP.DestinationAddress is
   set to the NextHopAddress.



Perkins & Chakeres     Expires September 13, 2012              [Page 23]

Internet-Draft                   AODVv2                       March 2012


   At this point, the packet or message that forced generation of this
   RERR SHOULD be discarded.

5.5.4.  RERR Handling

   First, ThisNode examines the RteMsg to ensure that it contains the
   required information: MsgHdr.HopLimit and
   AddBlk.UnreachableNode.Address.  If the required information do not
   exist, the message is discarded and further processing stopped.

   Next, ThisNode MAY selectively handle messages based upon information
   in the message.  ThisNode MAY choose to only handle messages from
   adjacent AODVv2 routers.  If ThisNode chooses not to handle this
   message, the message is discarded and further processing stopped.

   When an AODVv2 router handles a RERR, it examines each
   UnreachableNode's information.  The attending AODVv2 router removes
   the forwarding route, unsets the Route.Forwarding flag, sets the
   Route.Broken flag, and the timer for ROUTE_DELETE is set to
   ROUTE_DELETE_TIMEOUT for each UnreachableNode.Address found using
   longest prefix matching that meets all of the following conditions:

   1.  The UnreachableNode.Address is a multihop-capable unicast
       address.

   2.  The Route.NextHopAddress is the same as the RERR
       IP.SourceAddress.

   3.  The Route.NextHopInterface is the same as the interface on which
       the RERR was received.

   4.  The Route.SeqNum is zero (0), unknown, OR the
       UnreachableNode.SeqNum is zero (0), unknown, OR Route.SeqNum -
       UnreachableNode.SeqNum <= 0 (using signed 16-bit arithmetic).

   During handling if Route.SeqNum is zero (0) or unknown and
   UnreachableNode.SeqNum exists in the RERR and is not zero (0), then
   Route.SeqNum MAY be set to UnreachableNode.SeqNum.  Setting
   Route.SeqNum can reduce future RERR handling and forwarding.

   Each UnreachableNode that did not result in a broken route is removed
   from the RERR, since propagation of this information will not result
   in any benefit.

   Each UnreachableNode that did result in a broken route SHOULD remain
   in the RERR.

   If any UnreachableNode was removed, all other information (AddTLVs)



Perkins & Chakeres     Expires September 13, 2012              [Page 24]

Internet-Draft                   AODVv2                       March 2012


   associated with the removed address(es) MUST also be removed.

   After handling if Route.SeqNum is known and an UnreachableNode.SeqNum
   is not included in the RERR, then Route.SeqNum (i.e.
   UnreachableNode.SeqNum) MAY be added to the RERR.  Including
   UnreachableNode.SeqNum can reduce future RERR handling and
   forwarding.

   If no UnreachableNode addresses remain in the RERR, no other handling
   is required and the RERR is discarded.

   If handling continues, the MsgHdr.HopLimit is decremented by one (1).
   Further, if this RERR's new MsgHdr.HopLimit is greater than one (1)
   and at least one unreachable node address remains in the RERR, then
   the updated RERR SHOULD be sent.

   A multicast RERR is sent to the IP.DestinationAddress LL-MANET-
   Routers [RFC5498].  If the RERR is unicast, the IP.DestinationAddress
   is set to the NextHopAddress.

5.6.  Unknown Message and TLV Types

   If a message with an unknown type is received, the message is
   discarded.

   For handling of messages that contain unknown TLV types, the default
   behavior is to leave the information in control messages unmodified.
   Although, this behavior (UNKNOWN_TYPES) MAY be administratively
   controlled.

5.7.  Advertising Network Addresses

   AODVv2 routers specify the prefix length for each advertised address.
   Any nodes (other than the advertising AODVv2 router) within the
   advertised prefix MUST NOT participate in the AODVv2 protocol
   directly.  For example, advertising 192.0.2.1 with a prefix length of
   24 indicates that all nodes with the matching 192.0.2.X are reachable
   through this AODVv2 router.

5.8.  Simple Internet Attachment

   Simple Internet attachment consists of a stub network of AODVv2
   routers connected to the Internet via a single Internet AODVv2 router
   (IDR).

   AODVv2 routers, and hosts behind these routers, wishing to be
   reachable from hosts on the Internet MUST have IP addresses within
   the IDR's routable and topologically correct prefix (e.g.



Perkins & Chakeres     Expires September 13, 2012              [Page 25]

Internet-Draft                   AODVv2                       March 2012


   192.0.2.0/24).

   The IDR is responsible for generating RREQ to find nodes within the
   AODVv2 Region on behalf of nodes on the Internet, as well as
   responding to route requests from the AODVv2 region on behalf of the
   nodes on the Internet.

         /--------------------------\
        /          Internet          \
        \                            /
         \------------+-------------/
                      |
       Routable &     |
       Topologically  |
       Correct        |
       Prefix         |
                +-----+------+
                |  Internet  |
         /------|  AODVv2      |-------\
        /       |  Router    |        \
       /        |192.0.2.1/32|         \
       |        |Responsible |         |
       |        |  for       |         |
       |        |AODVv2 Region |         |
       |        |192.0.2.0/24|         |
       |        +------------+         |
       | +--------------+              |
       | | AODVv2 Router  |              |
       | | 192.0.2.2/32 |              |
       | +--------------+              |
       |              +--------------+ |
       |              | AODVv2 Router  | |
       |              | 192.0.2.3/32 | |
       \              +--------------+ /
        \                             /
         \---------------------------/

               Figure 1: Simple Internet Attachment Example

   When an AODVv2 router within the AODVv2 Region wants to discover a
   route to a node on the Internet, it uses the normal AODVv2 route
   discovery for that IP Destination Address.  The IDR is responsible
   for properly responding to RREQ on behalf of the Internet
   destination.

   When a packet from a node on the Internet destined for a node in the
   AODVv2 region reaches the IDR, if the IDR does not have a route to
   that destination it will perform normal AODVv2 route discovery for



Perkins & Chakeres     Expires September 13, 2012              [Page 26]

Internet-Draft                   AODVv2                       March 2012


   that destination.

5.9.  Multiple Interfaces

   AODVv2 may be used with multiple interfaces; therefore, the
   particular interface over which packets arrive MUST be known whenever
   a packet is received.  Whenever a new route is created, the interface
   through which the Route.Address can be reached is also recorded in
   the route table entry.

   When multiple interfaces are available, a node transmitting a
   multicast packet with IP.DestinationAddress set to LL-MANET-Routers
   SHOULD send the packet on all interfaces that have been configured
   for AODVv2 operation.

   Similarly, AODVv2 routers should subscribe to LL-MANET-Routers on all
   their AODVv2 interfaces.

5.10.  AODVv2 Control Packet/Message Generation Limits

   To ensure predictable control overhead, AODVv2 router's rate of
   packet/message generation SHOULD be limited.  The rate and algorithm
   for limiting messages (CONTROL_TRAFFIC_LIMITS) is left to the
   implementor and should be administratively configurable or
   intelligently controlled.  AODVv2 control messages SHOULD be
   discarded in the following order of preference: RREQ, RREP, and
   finally RERR.


6.  Administratively Configured Parameters and Timer Values

   AODVv2 contains several parameters which MUST be administratively
   configured.  The list of these follows:

              Required Administratively Configured Parameters

   +------------------------+------------------------------------------+
   |          Name          |                Description               |
   +------------------------+------------------------------------------+
   |  RESPONSIBLE_ADDRESSES |  List of addresses or routing prefixes,  |
   |                        |      for which this AODVv2 router is     |
   |                        |  responsible.  If, RESPONSIBLE_ADDRESSES |
   |                        |    is zero, this AODVv2 router is only   |
   |                        |    responsible for its own addresses.    |
   |    AODVv2_INTERFACES   |  List of the interfaces participating in |
   |                        |         AODVv2 routing protocol.         |
   +------------------------+------------------------------------------+




Perkins & Chakeres     Expires September 13, 2012              [Page 27]

Internet-Draft                   AODVv2                       March 2012


                                  Table 2

   AODVv2 contains a number of timers.  The default timing parameter
   values follow:

                      Default Timing Parameter Values

           +------------------------------+-------------------+
           |             Name             |       Value       |
           +------------------------------+-------------------+
           |         ROUTE_TIMEOUT        |     5 seconds     |
           |     ROUTE_AGE_MIN_TIMEOUT    |      1 second     |
           | ROUTE_SEQNUM_AGE_MAX_TIMEOUT |     60 seconds    |
           |      ROUTE_USED_TIMEOUT      |   ROUTE_TIMEOUT   |
           |     ROUTE_DELETE_TIMEOUT     | 2 * ROUTE_TIMEOUT |
           |     ROUTE_RREQ_WAIT_TIME     |     2 seconds     |
           | UNICAST_MESSAGE_SENT_TIMEOUT |      1 second     |
           +------------------------------+-------------------+

                                  Table 3

   The above timing parameter values work well for small and medium
   well-connected networks with moderate topology changes.

   The timing parameters SHOULD be administratively configurable for the
   network where AODVv2 is used.  Ideally, for networks with frequent
   topology changes the AODVv2 parameters should be adjusted using
   either experimentally determined values or dynamic adaptation.  For
   example, in networks with infrequent topology changes
   ROUTE_USED_TIMEOUT may be set to a much larger value.

                         Default Parameter Values

   +------------------------+-------+----------------------------------+
   |          Name          | Value |            Description           |
   +------------------------+-------+----------------------------------+
   |      MSG_HOPLIMIT      |   10  |  This value MUST be larger than  |
   |                        |  hops |   the AODVv2 network diameter.   |
   |                        |       |  Otherwise, routing messages may |
   |                        |       |     not reach their intended     |
   |                        |       |           destinations.          |
   | DISCOVERY_ATTEMPTS_MAX |   3   |   The number of route discovery  |
   |                        |       |      attempts to make before     |
   |                        |       |   indicating that a particular   |
   |                        |       |     address is not reachable.    |
   +------------------------+-------+----------------------------------+

                                  Table 4



Perkins & Chakeres     Expires September 13, 2012              [Page 28]

Internet-Draft                   AODVv2                       March 2012


   In addition to the above parameters and timing values, several
   administrative options exist.  These options have no influence on
   correct routing behavior, although they may potentially reduce AODVv2
   routing control messaging in certain situations.  The default
   behavior is to NOT enable any of these options; and although many of
   these options can be administratively controlled, they may be better
   served by intelligent control.  The following table enumerates
   several of the options.

                    Administratively Controlled Options

   +-------------------------+-----------------------------------------+
   |           Name          |               Description               |
   +-------------------------+-----------------------------------------+
   | BUFFER_DURING_DISCOVERY |   Whether and how much data to buffer   |
   |                         |         during route discovery.         |
   |      UNKNOWN_TYPES      | What action to take when an unknown TLV |
   |                         |  type is received.  The default action  |
   |                         |      is to forward this information     |
   |                         | unmodified.  Another action would be to |
   |                         |         remove this information.        |
   |  CONTROL_TRAFFIC_LIMITS |    AODVv2 control messaging SHOULD be   |
   |                         |    limited to avoid consuming all the   |
   |                         |            network bandwidth.           |
   +-------------------------+-----------------------------------------+

                                  Table 5

   Note: several fields have limited size (bits or bytes) these sizes
   and their encoding may place specific limitations on the values that
   can be set.  For example, MsgHdr.HopLimit is a 8-bit field and
   therefore MSG_HOPLIMIT cannot be larger than 255.


7.  IANA Considerations

   In its default mode of operation, AODVv2 uses the UDP port MANET
   [RFC5498] to carry protocol packets.  AODVv2 also uses the link-local
   multicast address LL-MANET-Routers [RFC5498].

   This section specifies several message types, message tlv-types, and
   address tlv-types.









Perkins & Chakeres     Expires September 13, 2012              [Page 29]

Internet-Draft                   AODVv2                       March 2012


7.1.  AODVv2 Message Types Specification

                           AODVv2 Message Types

                   +------------------------+----------+
                   |          Name          |   Type   |
                   +------------------------+----------+
                   |  Route Request (RREQ)  | 10 - TBD |
                   |   Route Reply (RREP)   | 11 - TBD |
                   |   Route Error (RERR)   | 12 - TBD |
                   +------------------------+----------+

                                  Table 6

7.2.  Message and Address Block TLV Type Specification

                             Message TLV Types

   +-------------------+------+--------+-------------------------------+
   |        Name       | Type | Length | Value                         |
   +-------------------+------+--------+-------------------------------+
   |  Unicast Response | 10 - |    0   | Indicates to the processing   |
   |      Request      |  TBD | octets | node that the previous hop    |
   |                   |      |        | (IP.SourceAddress) expects a  |
   |                   |      |        | unicast message within        |
   |                   |      |        | UNICAST_MESSAGE_SENT_TIMEOUT. |
   |                   |      |        | Any unicast packet will serve |
   |                   |      |        | this purpose, and it MAY be   |
   |                   |      |        | an ICMP REPLY message.  If a  |
   |                   |      |        | message is not sent, then the |
   |                   |      |        | previous hop can assume that  |
   |                   |      |        | the link is unidirectional    |
   |                   |      |        | and MAY blacklist the link to |
   |                   |      |        | this node.                    |
   +-------------------+------+--------+-------------------------------+

                                  Table 7














Perkins & Chakeres     Expires September 13, 2012              [Page 30]

Internet-Draft                   AODVv2                       March 2012


7.3.  Address Block TLV Specification

                          Address Block TLV Types

   +----------------+------------+----------+--------------------------+
   |      Name      |    Type    |  Length  | Value                    |
   +----------------+------------+----------+--------------------------+
   |     AODVv2     |  10 - TBD  |  up to 2 | The AODVv2 sequence num  |
   |    Sequence    |            |  octets  | associated with this     |
   |     Number     |            |          | address.  The sequence   |
   | (AODVv2SeqNum) |            |          | number may be the last   |
   |                |            |          | known sequence number.   |
   |    Distance    |  11 - TBD  |  up to 2 | A metric of the distance |
   |                |            |  octets  | traversed by the         |
   |                |            |          | information associated   |
   |                |            |          | with this address.       |
   |  VALIDITY_TIME | 1[RFC5497] |          | The maximum amount of    |
   |                |            |          | time that information    |
   |                |            |          | can be maintained before |
   |                |            |          | being deleted.  The      |
   |                |            |          | VALIDITY_TIME TLV is     |
   |                |            |          | defined in [RFC5497].    |
   +----------------+------------+----------+--------------------------+

                                  Table 8


8.  Security Considerations

   The objective of the AODVv2 protocol is for each router to
   communicate reachability information to addresses for which it is
   responsible.  Positive routing information (i.e. a route exists) is
   distributed via RteMsgs and negative routing information (i.e. a
   route does not exist) via RERRs.  AODVv2 routers that handle these
   messages store the contained information to properly forward data
   packets, and they generally provide this information to other AODVv2
   routers.

   This section does not mandate any specific security measures.
   Instead, this section describes various security considerations and
   potential avenues to secure AODVv2 routing.

   The most important security mechanisms for AODVv2 routing are
   integrity/authentication and confidentiality.

   In situations where routing information or router identity are
   suspect, integrity and authentication techniques SHOULD be applied to
   AODVv2 messages.  In these situations, routing information that is



Perkins & Chakeres     Expires September 13, 2012              [Page 31]

Internet-Draft                   AODVv2                       March 2012


   distributed over multiple hops SHOULD also verify the integrity and
   identity of information based on originator of the routing
   information.

   A digital signature could be used to identify the source of AODVv2
   messages and information, along with its authenticity.  A nonce or
   timestamp SHOULD also be used to protect against replay attacks.
   S/MIME and OpenPGP are two authentication/integrity protocols that
   could be adapted for this purpose.

   In situations where confidentiality of AODVv2 messages is important,
   cryptographic techniques can be applied.

   In certain situations, like sending a RREP or RERR, an AODVv2 router
   could include proof that it has previously received valid routing
   information to reach the destination, at one point of time in the
   past.  In situations where routers are suspected of transmitting
   maliciously erroneous information, the original routing information
   along with its security credentials SHOULD be included.

   Note that if multicast is used, any confidentiality and integrity
   algorithms used must permit multiple receivers to handle the message.


9.  Acknowledgments

   AODVv2 is a descendant of the design of previous MANET on-demand
   protocols, especially AODV [RFC3561] and DSR [RFC4728].  Changes to
   previous MANET on-demand protocols stem from research and
   implementation experiences.  Thanks to Elizabeth Belding-Royer for
   her long time authorship of AODVv2.  Additional thanks to Luke Klein-
   Berndt, Pedro Ruiz, Fransisco Ros, Koojana Kuladinithi, Ramon
   Caceres, Thomas Clausen, Christopher Dearlove, Seung Yi, Romain
   Thouvenin, Tronje Krop, Henner Jakob, Alexandru Petrescu, Christoph
   Sommer, Cong Yuan, Lars Kristensen, and Derek Atkins for reviewing of
   AODVv2, as well as several specification suggestions.

   Many good ideas from LOADng [I-D.clausen-lln-loadng] are shaping this
   evolution of the [manet] reactive routing protocol specification.
   Thanks are due to T. Clausen, A. Colin de Verdiere, J. Yi, A.
   Niktash, Y. Igarashi, SATOH.  H., and U. Herberg for their
   development of LOADng and sharing details for ensuring
   appropriateness of AODVv2 for LLNs.


10.  References





Perkins & Chakeres     Expires September 13, 2012              [Page 32]

Internet-Draft                   AODVv2                       March 2012


10.1.  Normative References

   [RFC1812]  Baker, F., "Requirements for IP Version 4 Routers",
              RFC 1812, June 1995.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC5082]  Gill, V., Heasley, J., Meyer, D., Savola, P., and C.
              Pignataro, "The Generalized TTL Security Mechanism
              (GTSM)", RFC 5082, October 2007.

   [RFC5444]  Clausen, T., Dearlove, C., Dean, J., and C. Adjih,
              "Generalized Mobile Ad Hoc Network (MANET) Packet/Message
              Format", RFC 5444, February 2009.

   [RFC5497]  Clausen, T. and C. Dearlove, "Representing Multi-Value
              Time in Mobile Ad Hoc Networks (MANETs)", RFC 5497,
              March 2009.

   [RFC5498]  Chakeres, I., "IANA Allocations for Mobile Ad Hoc Network
              (MANET) Protocols", RFC 5498, March 2009.

10.2.  Informative References

   [I-D.chakeres-manet-manetid]
              Chakeres, I., "MANET_ID TLV",
              draft-chakeres-manet-manetid-03 (work in progress),
              February 2008.

   [I-D.clausen-lln-loadng]
              Clausen, T., Verdiere, A., Yi, J., Niktash, A., Igarashi,
              Y., and U. Herberg, "The LLN On-demand Ad hoc Distance-
              vector Routing Protocol - Next Generation (LOADng)",
              draft-clausen-lln-loadng-01 (work in progress),
              October 2011.

   [I-D.ietf-manet-nhdp]
              Clausen, T., Dearlove, C., and J. Dean, "Mobile Ad Hoc
              Network (MANET) Neighborhood Discovery Protocol (NHDP)",
              draft-ietf-manet-nhdp-15 (work in progress),
              December 2010.

   [I-D.ietf-ospf-multi-instance]
              Lindem, A., Roy, A., and S. Mirtorabi, "OSPFv2 Multi-
              Instance Extensions", draft-ietf-ospf-multi-instance-09
              (work in progress), January 2012.




Perkins & Chakeres     Expires September 13, 2012              [Page 33]

Internet-Draft                   AODVv2                       March 2012


   [Perkins99]
              Perkins, C. and E. Belding-Royer, "Ad hoc On-Demand
              Distance Vector (AODV) Routing", Proceedings of the 2nd
              IEEE Workshop on Mobile Computing Systems and
              Applications, New Orleans, LA, pp. 90-100, February 1999.

   [RFC2328]  Moy, J., "OSPF Version 2", STD 54, RFC 2328, April 1998.

   [RFC3561]  Perkins, C., Belding-Royer, E., and S. Das, "Ad hoc On-
              Demand Distance Vector (AODV) Routing", RFC 3561,
              July 2003.

   [RFC4728]  Johnson, D., Hu, Y., and D. Maltz, "The Dynamic Source
              Routing Protocol (DSR) for Mobile Ad Hoc Networks for
              IPv4", RFC 4728, February 2007.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              September 2007.

   [RFC5148]  Clausen, T., Dearlove, C., and B. Adamson, "Jitter
              Considerations in Mobile Ad Hoc Networks (MANETs)",
              RFC 5148, February 2008.

   [RFC5340]  Coltun, R., Ferguson, D., Moy, J., and A. Lindem, "OSPF
              for IPv6", RFC 5340, July 2008.


Appendix A.  Changes since the Previous Version

   o  Protocol renamed to be AODVv2

   o  Intermediate RREPs (iRREPs) are to be put into new document.
      Without iRREP, only the destination can respond to a RREQ.

   o  Precursor lists not supported, based on reported performance loss.

   o  Routing Messages MUST be originated with the MsgHdr.HopLimit set
      to MSG_HOPLIMIT.  Previously, this was not mandated.

   o  Adding additional unreachable destinations to RERR is not
      specified in this document, to match LOADng behavior.


Appendix B.  Proposed additional changes for LOADng conformance






Perkins & Chakeres     Expires September 13, 2012              [Page 34]

Internet-Draft                   AODVv2                       March 2012


   o  Revise message formats to be compatible with LOADng requirements,
      removing RFC 5444 headers for minimal packet size

   o  Adding RREP-ACK message type instead of relying on reception of
      arbitrary packets as sufficient response to establish
      bidirectionality.


Appendix C.  Shifting Responsibility for an Address Between AODVv2
             Routers

   Only one AODVv2 router within a routing region SHOULD be responsible
   for a particular address at any time.  If two AODVv2 routers
   dynamically pass responsibility of an address correct AODVv2 routing
   behavior must be observed.  The AODVv2 router adding the new address
   must wait for any exiting routing information about this address to
   be purged from the network.  Therefore, it must wait at least
   ROUTER_SEQNUM_AGE_MAX_TIMEOUT after the previous AODVv2 router for
   this address stopped participating and advertising routing
   information on its behalf.


Authors' Addresses

   Charles E. Perkins
   Central Expressway
   San Jose, CA  95050
   USA

   Phone: +1-408-421-1172
   Email: charliep@computer.org


   Ian D Chakeres
   CenGen
   9250 Bendix Road North
   Columbia, Maryland  21045
   USA

   Email: ian.chakeres@gmail.com
   URI:   http://www.ianchak.com/










Perkins & Chakeres     Expires September 13, 2012              [Page 35]


